kkikione999/kimi-fly/firmware/stm32/src/sensor_test_main.c
/**
 * @file sensor_test_main.c
 * @brief STM32F411CEU6 传感器测试程序
 *
 * 注意: 本程序使用 USART1 (PA9=TX, PA10=RX) 作为调试输出
 *       ST-Link VCP 通过 PA9/PA10 连接到调试串口
 *
 * 测试三传感器:
 *   - ICM-42688-P (IMU, I2C1, 0x68)
 *   - LPS22HBTR (气压计, SPI3)
 *   - QMC5883P (磁力计, I2C1, 0x2C)
 */

#include "stm32f4xx_hal.h"
#include <string.h>
#include <stdio.h>
#include <stdarg.h>

/* ============================================================================
 * 硬件配置
 * ============================================================================ */

#define UART_BAUDRATE           460800U
#define I2C_CLOCK_SPEED         400000U

/* I2C 设备地址 */
/* ICM-42688-P: AD0 pin pulled HIGH on this hardware -> addr 0x69 */
#define ICM42688_ADDR           0x69U
#define QMC5883P_ADDR           0x2CU

/* ICM-42688-P 寄存器 */
#define ICM42688_REG_WHO_AM_I       0x75U
#define ICM42688_REG_PWR_MGMT0      0x4EU
#define ICM42688_REG_GYRO_CONFIG0   0x4FU
#define ICM42688_REG_ACCEL_CONFIG0  0x50U
#define ICM42688_REG_TEMP_DATA1     0x1DU
#define ICM42688_WHO_AM_I_VALUE     0x47U

/* LPS22HBTR 寄存器 */
#define LPS22HB_REG_WHO_AM_I        0x0FU
#define LPS22HB_REG_CTRL_REG1       0x10U
#define LPS22HB_REG_CTRL_REG2       0x11U
#define LPS22HB_REG_PRESS_OUT_XL    0x28U
#define LPS22HB_REG_TEMP_OUT_L      0x2BU
#define LPS22HB_WHO_AM_I_VALUE      0xB1U
#define LPS22HB_SPI_READ_BIT        0x80U

/* QMC5883P 寄存器 */
#define QMC5883P_REG_XOUT_L         0x00U
#define QMC5883P_REG_CTRL1          0x0BU
#define QMC5883P_REG_CTRL2          0x0CU

/* ============================================================================
 * 全局变量
 * ============================================================================ */

UART_HandleTypeDef huart1;
I2C_HandleTypeDef hi2c1;
SPI_HandleTypeDef hspi3;

static char g_tx_buffer[256];

/* ============================================================================
 * 函数声明
 * ============================================================================ */

static void SystemClock_Config(void);
static void GPIO_Init(void);
static void UART1_Init(void);
static void I2C1_Init(void);
static void SPI3_Init(void);

static void sensor_printf(const char *format, ...);

static HAL_StatusTypeDef I2C_Scan(uint8_t *found_addrs, uint8_t *found_count);
static HAL_StatusTypeDef I2C_ReadReg(uint16_t dev_addr, uint8_t reg, uint8_t *data);
static HAL_StatusTypeDef I2C_WriteReg(uint16_t dev_addr, uint8_t reg, uint8_t data);
static HAL_StatusTypeDef I2C_ReadRegs(uint16_t dev_addr, uint8_t reg, uint8_t *data, uint16_t len);
static HAL_StatusTypeDef SPI_ReadReg(uint8_t reg, uint8_t *data);
static HAL_StatusTypeDef SPI_WriteReg(uint8_t reg, uint8_t data);
static HAL_StatusTypeDef SPI_ReadRegs(uint8_t reg, uint8_t *data, uint16_t len);

static HAL_StatusTypeDef ICM42688_Init(void);
static HAL_StatusTypeDef ICM42688_ReadData(float *ax, float *ay, float *az,
                                            float *gx, float *gy, float *gz,
                                            float *temp);
static HAL_StatusTypeDef LPS22HB_Init(void);
static HAL_StatusTypeDef LPS22HB_ReadData(float *pressure, float *temp);
static HAL_StatusTypeDef QMC5883P_Init(void);
static HAL_StatusTypeDef QMC5883P_ReadData(float *mx, float *my, float *mz);
void Error_Handler(void);
#ifdef IMU_MAP_MODE
static void RunIMUMapMode(void);
#endif

/* ============================================================================
 * 基础函数
 * ============================================================================ */

static void sensor_printf(const char *format, ...)
{
    va_list args;
    int len;
    va_start(args, format);
    len = vsnprintf(g_tx_buffer, sizeof(g_tx_buffer), format, args);
    va_end(args);
    if (len > 0 && len < (int)sizeof(g_tx_buffer)) {
        HAL_UART_Transmit(&huart1, (uint8_t *)g_tx_buffer, len, 200);
    }
}

/* ============================================================================
 * I2C 辅助函数
 * ============================================================================ */

static HAL_StatusTypeDef I2C_Scan(uint8_t *found_addrs, uint8_t *found_count)
{
    *found_count = 0;
    for (uint16_t addr = 0x08; addr <= 0x77; addr++) {
        if (HAL_I2C_IsDeviceReady(&hi2c1, addr << 1, 1, 100) == HAL_OK) {
            if (*found_count < 16) {
                found_addrs[*found_count] = (uint8_t)addr;
            }
            (*found_count)++;
        }
    }
    return HAL_OK;
}

static HAL_StatusTypeDef I2C_ReadReg(uint16_t dev_addr, uint8_t reg, uint8_t *data)
{
    return HAL_I2C_Mem_Read(&hi2c1, dev_addr << 1, reg, I2C_MEMADD_SIZE_8BIT, data, 1, 100);
}

static HAL_StatusTypeDef I2C_WriteReg(uint16_t dev_addr, uint8_t reg, uint8_t data)
{
    return HAL_I2C_Mem_Write(&hi2c1, dev_addr << 1, reg, I2C_MEMADD_SIZE_8BIT, &data, 1, 100);
}

static HAL_StatusTypeDef I2C_ReadRegs(uint16_t dev_addr, uint8_t reg, uint8_t *data, uint16_t len)
{
    return HAL_I2C_Mem_Read(&hi2c1, dev_addr << 1, reg, I2C_MEMADD_SIZE_8BIT, data, len, 100);
}

/* ============================================================================
 * SPI 辅助函数
 * ============================================================================ */

static HAL_StatusTypeDef SPI_ReadReg(uint8_t reg, uint8_t *data)
{
    uint8_t tx[2] = {reg | LPS22HB_SPI_READ_BIT, 0xFF};
    uint8_t rx[2];
    HAL_StatusTypeDef st;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_15, GPIO_PIN_RESET);
    st = HAL_SPI_TransmitReceive(&hspi3, tx, rx, 2, 100);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_15, GPIO_PIN_SET);
    *data = rx[1];
    return st;
}

static HAL_StatusTypeDef SPI_WriteReg(uint8_t reg, uint8_t data)
{
    uint8_t tx[2] = {reg, data};
    HAL_StatusTypeDef st;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_15, GPIO_PIN_RESET);
    st = HAL_SPI_Transmit(&hspi3, tx, 2, 100);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_15, GPIO_PIN_SET);
    return st;
}

static HAL_StatusTypeDef SPI_ReadRegs(uint8_t reg, uint8_t *data, uint16_t len)
{
    uint8_t cmd = reg | LPS22HB_SPI_READ_BIT;
    HAL_StatusTypeDef st;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_15, GPIO_PIN_RESET);
    st = HAL_SPI_Transmit(&hspi3, &cmd, 1, 100);
    if (st == HAL_OK) {
        st = HAL_SPI_Receive(&hspi3, data, len, 100);
    }
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_15, GPIO_PIN_SET);
    return st;
}

/* ============================================================================
 * ICM-42688-P 驱动
 * ============================================================================ */

