kkikione999/kimi-fly/firmware/stm32/src/sensor_test_main.c
static HAL_StatusTypeDef ICM42688_Init(void)
{
    uint8_t id;
    HAL_StatusTypeDef st;

    st = I2C_ReadReg(ICM42688_ADDR, ICM42688_REG_WHO_AM_I, &id);
    if (st != HAL_OK) {
        sensor_printf("[ERROR] ICM42688 I2C failed st=%d\r\n", st);
        return HAL_ERROR;
    }
    if (id != ICM42688_WHO_AM_I_VALUE) {
        sensor_printf("[ERROR] ICM42688 WHO_AM_I=0x%02X (expect 0x47)\r\n", id);
        return HAL_ERROR;
    }

    st = I2C_WriteReg(ICM42688_ADDR, ICM42688_REG_PWR_MGMT0, 0x0F);
    if (st != HAL_OK) return st;
    HAL_Delay(10);

    st = I2C_WriteReg(ICM42688_ADDR, ICM42688_REG_GYRO_CONFIG0, 0x06);
    if (st != HAL_OK) return st;

    st = I2C_WriteReg(ICM42688_ADDR, ICM42688_REG_ACCEL_CONFIG0, 0x06);
    if (st != HAL_OK) return st;
    HAL_Delay(10);

    return HAL_OK;
}

static HAL_StatusTypeDef ICM42688_ReadData(float *ax, float *ay, float *az,
                                            float *gx, float *gy, float *gz,
                                            float *temp)
{
    uint8_t data[14];
    int16_t raw_t, raw_ax, raw_ay, raw_az, raw_gx, raw_gy, raw_gz;
    HAL_StatusTypeDef st;

    st = I2C_ReadRegs(ICM42688_ADDR, ICM42688_REG_TEMP_DATA1, data, 14);
    if (st != HAL_OK) return st;

    raw_t  = (int16_t)((data[0]  << 8) | data[1]);
    raw_ax = (int16_t)((data[2]  << 8) | data[3]);
    raw_ay = (int16_t)((data[4]  << 8) | data[5]);
    raw_az = (int16_t)((data[6]  << 8) | data[7]);
    raw_gx = (int16_t)((data[8]  << 8) | data[9]);
    raw_gy = (int16_t)((data[10] << 8) | data[11]);
    raw_gz = (int16_t)((data[12] << 8) | data[13]);

    *temp = (raw_t / 132.48f) + 25.0f;
    *ax = raw_ax * 0.00048828125f;
    *ay = raw_ay * 0.00048828125f;
    *az = raw_az * 0.00048828125f;
    *gx = raw_gx * 0.06103515625f;
    *gy = raw_gy * 0.06103515625f;
    *gz = raw_gz * 0.06103515625f;

    return HAL_OK;
}

/* ============================================================================
 * LPS22HBTR 驱动
 * ============================================================================ */

static HAL_StatusTypeDef LPS22HB_Init(void)
{
    uint8_t id;
    HAL_StatusTypeDef st;

    st = SPI_ReadReg(LPS22HB_REG_WHO_AM_I, &id);
    if (st != HAL_OK) {
        sensor_printf("[ERROR] LPS22HB SPI failed st=%d\r\n", st);
        return HAL_ERROR;
    }
    /* Accept 0xB1 (LPS22HB) and 0xB3 (LPS22HH - compatible variant) */
    if (id != LPS22HB_WHO_AM_I_VALUE && id != 0xB3U) {
        sensor_printf("[ERROR] LPS22HB WHO_AM_I=0x%02X (expect 0xB1 or 0xB3)\r\n", id);
        return HAL_ERROR;
    }
    sensor_printf("[INFO] Baro WHO_AM_I=0x%02X (%s)\r\n", id,
                  id == 0xB3U ? "LPS22HH" : "LPS22HB");

    st = SPI_WriteReg(LPS22HB_REG_CTRL_REG2, 0x04);  /* sw reset */
    if (st != HAL_OK) return st;
    HAL_Delay(10);

    st = SPI_WriteReg(LPS22HB_REG_CTRL_REG1, 0x34);  /* 25Hz ODR, BDU */
    if (st != HAL_OK) return st;
    HAL_Delay(50);

    return HAL_OK;
}

static HAL_StatusTypeDef LPS22HB_ReadData(float *pressure, float *temp)
{
    uint8_t data[5];
    uint8_t status_reg;
    int32_t raw_p;
    int16_t raw_t;
    HAL_StatusTypeDef st;
    uint8_t retries = 0;

    /* Wait for data ready: STATUS reg bit 0=P_DA, bit 1=T_DA */
    do {
        st = SPI_ReadReg(0x27, &status_reg);  /* STATUS register */
        if (st != HAL_OK) return st;
        if (++retries > 100) break;
        HAL_Delay(5);
    } while ((status_reg & 0x01) == 0);

    st = SPI_ReadRegs(LPS22HB_REG_PRESS_OUT_XL, data, 5);
    if (st != HAL_OK) return st;

    raw_p = ((int32_t)data[2] << 16) | ((int32_t)data[1] << 8) | data[0];
    if (raw_p & 0x00800000) raw_p |= (int32_t)0xFF000000;
    raw_t = (int16_t)((data[4] << 8) | data[3]);

    *pressure = raw_p / 4096.0f;
    *temp = raw_t / 100.0f;

    return HAL_OK;
}

/* ============================================================================
 * QMC5883P 驱动
 * ============================================================================ */

static HAL_StatusTypeDef QMC5883P_Init(void)
{
    HAL_StatusTypeDef st;

    st = I2C_WriteReg(QMC5883P_ADDR, QMC5883P_REG_CTRL2, 0x80);  /* soft reset */
    if (st != HAL_OK) return st;
    HAL_Delay(10);

    st = I2C_WriteReg(QMC5883P_ADDR, QMC5883P_REG_CTRL1, 0x79);  /* continuous, 100Hz, 2G, OSR512 */
    if (st != HAL_OK) return st;
    HAL_Delay(20);

    return HAL_OK;
}

static HAL_StatusTypeDef QMC5883P_ReadData(float *mx, float *my, float *mz)
{
    uint8_t data[6];
    uint8_t status;
    int16_t raw_x, raw_y, raw_z;
    HAL_StatusTypeDef st;
    uint8_t retries = 0;

    /* Wait for DRDY: STATUS[0]=DRDY */
    do {
        st = I2C_ReadReg(QMC5883P_ADDR, 0x06, &status);  /* STATUS reg */
        if (st != HAL_OK) return st;
        if (++retries > 50) break;
        HAL_Delay(5);
    } while ((status & 0x01) == 0);

    st = I2C_ReadRegs(QMC5883P_ADDR, QMC5883P_REG_XOUT_L, data, 6);
    if (st != HAL_OK) return st;

    raw_x = (int16_t)((data[1] << 8) | data[0]);
    raw_y = (int16_t)((data[3] << 8) | data[2]);
    raw_z = (int16_t)((data[5] << 8) | data[4]);

    /* CTRL1=0x79 sets RNG=11 (8G), sensitivity=3000 LSB/G */
    *mx = raw_x / 3000.0f;
    *my = raw_y / 3000.0f;
    *mz = raw_z / 3000.0f;

    return HAL_OK;
}

/* ============================================================================
 * 外设初始化
 * ============================================================================ */

static void GPIO_Init(void)
{
    GPIO_InitTypeDef GPIO_InitStruct = {0};

    __HAL_RCC_GPIOA_CLK_ENABLE();
    __HAL_RCC_GPIOB_CLK_ENABLE();

    /* PA15 - SPI3 CS */
    GPIO_InitStruct.Pin = GPIO_PIN_15;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_15, GPIO_PIN_SET);

    /* PB14 - LED */
    GPIO_InitStruct.Pin = GPIO_PIN_14;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
    HAL_GPIO_WritePin(GPIOB, GPIO_PIN_14, GPIO_PIN_RESET);
}

static void UART1_Init(void)
{
    GPIO_InitTypeDef GPIO_InitStruct = {0};

    __HAL_RCC_GPIOA_CLK_ENABLE();
    __HAL_RCC_USART1_CLK_ENABLE();

    /* PA9 (TX), PA10 (RX) */
    GPIO_InitStruct.Pin = GPIO_PIN_9 | GPIO_PIN_10;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF7_USART1;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

