kkikione999/kimi-fly/firmware/stm32/src/sensor_test_main.c
    huart1.Instance = USART1;
    huart1.Init.BaudRate = UART_BAUDRATE;
    huart1.Init.WordLength = UART_WORDLENGTH_8B;
    huart1.Init.StopBits = UART_STOPBITS_1;
    huart1.Init.Parity = UART_PARITY_NONE;
    huart1.Init.Mode = UART_MODE_TX_RX;
    huart1.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    huart1.Init.OverSampling = UART_OVERSAMPLING_16;
    HAL_UART_Init(&huart1);
}

static void I2C1_Init(void)
{
    GPIO_InitTypeDef GPIO_InitStruct = {0};

    __HAL_RCC_GPIOB_CLK_ENABLE();
    __HAL_RCC_I2C1_CLK_ENABLE();

    GPIO_InitStruct.Pin = GPIO_PIN_6 | GPIO_PIN_7;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_OD;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF4_I2C1;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

    hi2c1.Instance = I2C1;
    hi2c1.Init.ClockSpeed = I2C_CLOCK_SPEED;
    hi2c1.Init.DutyCycle = I2C_DUTYCYCLE_2;
    hi2c1.Init.OwnAddress1 = 0;
    hi2c1.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
    hi2c1.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
    hi2c1.Init.OwnAddress2 = 0;
    hi2c1.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
    hi2c1.Init.NoStretchMode = I2C_NOSTRETCH_DISABLE;
    HAL_I2C_Init(&hi2c1);
}

static void SPI3_Init(void)
{
    GPIO_InitTypeDef GPIO_InitStruct = {0};

    __HAL_RCC_GPIOB_CLK_ENABLE();
    __HAL_RCC_SPI3_CLK_ENABLE();

    GPIO_InitStruct.Pin = GPIO_PIN_3 | GPIO_PIN_4 | GPIO_PIN_5;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF6_SPI3;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

    hspi3.Instance = SPI3;
    hspi3.Init.Mode = SPI_MODE_MASTER;
    hspi3.Init.Direction = SPI_DIRECTION_2LINES;
    hspi3.Init.DataSize = SPI_DATASIZE_8BIT;
    hspi3.Init.CLKPolarity = SPI_POLARITY_LOW;
    hspi3.Init.CLKPhase = SPI_PHASE_1EDGE;
    hspi3.Init.NSS = SPI_NSS_SOFT;
    hspi3.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_8;
    hspi3.Init.FirstBit = SPI_FIRSTBIT_MSB;
    hspi3.Init.TIMode = SPI_TIMODE_DISABLE;
    hspi3.Init.CRCCalculation = SPI_CRCCALCULATION_DISABLE;
    hspi3.Init.CRCPolynomial = 10;
    HAL_SPI_Init(&hspi3);
}

static void SystemClock_Config(void)
{
    RCC_OscInitTypeDef RCC_OscInitStruct = {0};
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

    /* Enable PWR clock and set voltage scaling to Scale1 for PLL */
    __HAL_RCC_PWR_CLK_ENABLE();
    __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

    /* Use HSI (16MHz internal oscillator) - no external crystal dependency
     * 16MHz HSI / PLLM(16) * PLLN(200) / PLLP(2) = 100MHz SYSCLK */
    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
    RCC_OscInitStruct.HSIState = RCC_HSI_ON;
    RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
    RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
    RCC_OscInitStruct.PLL.PLLM = 16;   /* 16MHz / 16 = 1MHz VCO input */
    RCC_OscInitStruct.PLL.PLLN = 200;  /* 1MHz * 200 = 200MHz VCO output */
    RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;  /* 200MHz / 2 = 100MHz SYSCLK */
    RCC_OscInitStruct.PLL.PLLQ = 4;
    if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) {
        /* PLL failed - stay on HSI at 16MHz, peripherals will still work */
        return;
    }

    /* SYSCLK = 100MHz, HCLK = 100MHz, APB1 = 50MHz, APB2 = 100MHz
     * FLASH_LATENCY_3 required for HCLK > 90MHz @ 2.7-3.6V */
    RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK |
                                  RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
    RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;
    if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_3) != HAL_OK) {
        /* Clock switch failed - remain on HSI */
        return;
    }
}

#ifdef IMU_MAP_MODE
static void RunIMUMapMode(void)
{
    HAL_StatusTypeDef status;
    float ax = 0.0f, ay = 0.0f, az = 0.0f;
    float gx = 0.0f, gy = 0.0f, gz = 0.0f;
    float temp = 0.0f;
    float gx_bias = 0.0f, gy_bias = 0.0f, gz_bias = 0.0f;
    uint32_t sample = 0U;
    int32_t gx_bias_mdps;
    int32_t gy_bias_mdps;
    int32_t gz_bias_mdps;

    sensor_printf("\r\n");
    sensor_printf("========================================\r\n");
    sensor_printf("  IMU MAP MODE v1.0 (STM32F411)\r\n");
    sensor_printf("========================================\r\n");
    sensor_printf("Goal: reverse sensor XYZ -> body XYZ without opening the airframe.\r\n");
    sensor_printf("Body frame target: +X forward, +Y left, +Z up.\r\n");
    sensor_printf("Hold still for gyro bias collection...\r\n");

    status = ICM42688_Init();
    if (status != HAL_OK) {
        sensor_printf("[FAIL] ICM42688 init failed st=%d\r\n", status);
        Error_Handler();
    }

    for (uint16_t i = 0U; i < 200U; i++) {
        status = ICM42688_ReadData(&ax, &ay, &az, &gx, &gy, &gz, &temp);
        if (status == HAL_OK) {
            gx_bias += gx;
            gy_bias += gy;
            gz_bias += gz;
        }
        HAL_Delay(5);
    }

    gx_bias /= 200.0f;
    gy_bias /= 200.0f;
    gz_bias /= 200.0f;

    gx_bias_mdps = (int32_t)(gx_bias * 1000.0f);
    gy_bias_mdps = (int32_t)(gy_bias * 1000.0f);
    gz_bias_mdps = (int32_t)(gz_bias * 1000.0f);

    sensor_printf("[BIAS_MDPS] gx=%ld gy=%ld gz=%ld\r\n",
                  (long)gx_bias_mdps,
                  (long)gy_bias_mdps,
                  (long)gz_bias_mdps);
    sensor_printf("[PRIOR] old-code candidate: bodyX=-imuY bodyY=-imuX bodyZ=+imuZ(acc)/-imuZ(gyro)\r\n");
    sensor_printf("[LOG] [IMU_RAW] ms ax_mg ay_mg az_mg gx_mdps gy_mdps gz_mdps temp_cdeg\r\n");

    while (1) {
        status = ICM42688_ReadData(&ax, &ay, &az, &gx, &gy, &gz, &temp);
        if (status == HAL_OK) {
            int32_t ax_mg = (int32_t)(ax * 1000.0f);
            int32_t ay_mg = (int32_t)(ay * 1000.0f);
            int32_t az_mg = (int32_t)(az * 1000.0f);
            int32_t gx_mdps = (int32_t)((gx - gx_bias) * 1000.0f);
            int32_t gy_mdps = (int32_t)((gy - gy_bias) * 1000.0f);
            int32_t gz_mdps = (int32_t)((gz - gz_bias) * 1000.0f);
            int32_t temp_cdeg = (int32_t)(temp * 100.0f);

            sensor_printf("[IMU_RAW] %lu %ld %ld %ld %ld %ld %ld %ld\r\n",
                          (unsigned long)HAL_GetTick(),
                          (long)ax_mg,
                          (long)ay_mg,
                          (long)az_mg,
                          (long)gx_mdps,
                          (long)gy_mdps,
                          (long)gz_mdps,
                          (long)temp_cdeg);
        } else {
            sensor_printf("[IMU_ERR] read failed st=%d\r\n", status);
        }

        sample++;
        if ((sample % 10U) == 0U) {
            HAL_GPIO_TogglePin(GPIOB, GPIO_PIN_14);
        }
        HAL_Delay(50);
    }
}
#endif

/* ============================================================================
 * 主函数
 * ============================================================================ */

int main(void)
{
    uint8_t found_addrs[16];
    uint8_t found_count = 0;
    HAL_StatusTypeDef status;
    uint8_t imu_ok = 0, baro_ok = 0, mag_ok = 0;

    HAL_Init();
    SystemClock_Config();
    GPIO_Init();
    UART1_Init();
    I2C1_Init();
    SPI3_Init();

    /* 等待 2 秒让串口监视器就绪 */
    HAL_Delay(2000);

#ifdef IMU_MAP_MODE
    RunIMUMapMode();
#endif

    sensor_printf("\r\n");
    sensor_printf("========================================\r\n");
    sensor_printf("  SENSOR TEST v1.0 (STM32F411)\r\n");
    sensor_printf("========================================\r\n\r\n");

    /* --- Test 1: I2C Bus Scan --- */
    sensor_printf("--- Test 1: I2C Bus Scan ---\r\n");
    I2C_Scan(found_addrs, &found_count);
    sensor_printf("Found %d I2C device(s):\r\n", found_count);
    for (uint8_t i = 0; i < found_count && i < 16; i++) {
        sensor_printf("  [FOUND] 0x%02X", found_addrs[i]);
        if (found_addrs[i] == ICM42688_ADDR) sensor_printf(" (ICM-42688-P)");
        if (found_addrs[i] == QMC5883P_ADDR) sensor_printf(" (QMC5883P)");
        sensor_printf("\r\n");
    }

