kkikione999/kimi-fly/firmware/stm32/src/sensor_test_main.c
    uint8_t icm_found = 0, qmc_found = 0;
    for (uint8_t i = 0; i < found_count; i++) {
        if (found_addrs[i] == ICM42688_ADDR) icm_found = 1;
        if (found_addrs[i] == QMC5883P_ADDR) qmc_found = 1;
    }
    sensor_printf("I2C: ICM=%s, QMC=%s\r\n\r\n",
                  icm_found ? "OK" : "MISS",
                  qmc_found ? "OK" : "MISS");

    /* --- Test 2: ICM-42688-P IMU --- */
    sensor_printf("--- Test 2: ICM-42688-P IMU ---\r\n");
    status = ICM42688_Init();
    if (status == HAL_OK) {
        sensor_printf("[PASS] WHO_AM_I=0x47\r\n");
        sensor_printf("#    AccX(g)   AccY(g)   AccZ(g)   GyrX      GyrY      GyrZ      T(C)\r\n");

        float ax, ay, az, gx, gy, gz, temp;
        for (uint8_t i = 0; i < 10; i++) {
            status = ICM42688_ReadData(&ax, &ay, &az, &gx, &gy, &gz, &temp);
            if (status == HAL_OK) {
                char line[128];
                snprintf(line, sizeof(line), "%-4d %9.3f %9.3f %9.3f %9.2f %9.2f %9.2f %5.1f\r\n",
                         i + 1, ax, ay, az, gx, gy, gz, temp);
                HAL_UART_Transmit(&huart1, (uint8_t *)line, strlen(line), 200);
            } else {
                sensor_printf("[ERR] Read failed\r\n");
            }
            HAL_Delay(100);
        }
        sensor_printf("[PASS] IMU done\r\n\r\n");
        imu_ok = 1;
    } else {
        sensor_printf("[FAIL] IMU init failed\r\n\r\n");
    }

    /* --- Test 3: LPS22HBTR Barometer --- */
    sensor_printf("--- Test 3: LPS22HBTR Barometer ---\r\n");
    status = LPS22HB_Init();
    if (status == HAL_OK) {
        sensor_printf("[PASS] WHO_AM_I=0xB1\r\n");
        sensor_printf("#    Pressure(hPa)  Temp(C)\r\n");

        float pressure, temp;
        for (uint8_t i = 0; i < 10; i++) {
            status = LPS22HB_ReadData(&pressure, &temp);
            if (status == HAL_OK) {
                char line[64];
                snprintf(line, sizeof(line), "%-4d %13.3f %8.2f\r\n", i + 1, pressure, temp);
                HAL_UART_Transmit(&huart1, (uint8_t *)line, strlen(line), 200);
            } else {
                sensor_printf("[ERR] Read failed\r\n");
            }
            HAL_Delay(50);
        }
        sensor_printf("[PASS] Barometer done\r\n\r\n");
        baro_ok = 1;
    } else {
        sensor_printf("[FAIL] Barometer init failed\r\n\r\n");
    }

    /* --- Test 4: QMC5883P Magnetometer --- */
    sensor_printf("--- Test 4: QMC5883P Magnetometer ---\r\n");
    status = QMC5883P_Init();
    if (status == HAL_OK) {
        sensor_printf("[PASS] Magnetometer initialized\r\n");
        sensor_printf("#    MagX(G)   MagY(G)   MagZ(G)\r\n");

        float mx, my, mz;
        for (uint8_t i = 0; i < 10; i++) {
            status = QMC5883P_ReadData(&mx, &my, &mz);
            if (status == HAL_OK) {
                char line[64];
                snprintf(line, sizeof(line), "%-4d %9.3f %9.3f %9.3f\r\n", i + 1, mx, my, mz);
                HAL_UART_Transmit(&huart1, (uint8_t *)line, strlen(line), 200);
            } else {
                sensor_printf("[ERR] Read failed\r\n");
            }
            HAL_Delay(100);
        }
        sensor_printf("[PASS] Magnetometer done\r\n\r\n");
        mag_ok = 1;
    } else {
        sensor_printf("[FAIL] Magnetometer init failed\r\n\r\n");
    }

    /* --- Summary --- */
    sensor_printf("========================================\r\n");
    sensor_printf("  TEST REPORT\r\n");
    sensor_printf("========================================\r\n");
    sensor_printf("I2C Scan:    %d devices\r\n", found_count);
    sensor_printf("ICM-42688-P: %s\r\n", imu_ok ? "PASS" : "FAIL");
    sensor_printf("LPS22HBTR:   %s\r\n", baro_ok ? "PASS" : "FAIL");
    sensor_printf("QMC5883P:    %s\r\n", mag_ok ? "PASS" : "FAIL");
    sensor_printf("ALL DONE.\r\n");

    while (1) {
        HAL_GPIO_TogglePin(GPIOB, GPIO_PIN_14);
        HAL_Delay(500);
    }
}

void SysTick_Handler(void)
{
    HAL_IncTick();
}

void Error_Handler(void)
{
    sensor_printf("[ERROR] Error_Handler\r\n");
    while (1) {
        HAL_GPIO_TogglePin(GPIOB, GPIO_PIN_14);
        HAL_Delay(100);
    }
}
